#+TITLE: Advanced machine learning - Homework A
#+SUBTITLE: Graph Neural Networks
#+SETUPFILE: ~/Dropbox/org/org-roam/setup_file.org
#+EXPORT_FILE_NAME: report
#+options: toc:3 num:3

*** Supervised learning with a MLP
First attempt to use supervised learning on the small training dataset.
Construct an MLP using =Keras= subclassing. It's a simple two-layer perceptron
with a softmax activation function for classification.

Define some parameters used in the model and for training
#+name: mlp-params
#+begin_src jupyter-python :results silent
hidden_layers = 16
patience = 5 # epochs with no improvement
lr = 1e-2
num_epochs = 100
batch_size = 16
#+end_src

Define the model
#+name: mlp-model
#+caption: MLP model definition.
#+begin_src jupyter-python :results silent
class MLP(Model):
    def __init__(self, n_hidden, n_classes):
        super(MLP, self).__init__()
        self.dense = Dense(n_node_features, activation='relu')
        self.dropout = Dropout(0.5)
        self.classifier = Dense(n_classes, activation='softmax')

    def call(self, inputs, training=False):
        out = self.dense(inputs)
        if training:
            out = self.dropout(out, training=training)
        return self.classifier(out)
#+end_src

Use cross-entropy for the loss function. Train it with the =EarlyStopping=
callback, each epoch tests against the validation split. When patience is exceeded, restore the best performing model (on the validation split).
#+name: mlp-train
#+begin_src jupyter-python
loss_fn = CategoricalCrossentropy()
optimizer = Adam(learning_rate=lr)
model = MLP(hidden_layers, n_labels)

model.compile(optimizer=optimizer, loss=loss_fn, metrics=['acc'])
history = model.fit(
    x[mask_tr],
    y[mask_tr],
    batch_size=batch_size,
    epochs=num_epochs,
    validation_data=(x[mask_va], y[mask_va]),
    verbose=2,
    callbacks=[EarlyStopping(
        monitor='val_loss',
        mode='min',
        patience=patience,
        restore_best_weights=True,
    )]
)

model.save(f'trained_models/mlp')
#+end_src

Figure ref:fig:mlp-metrics shows the loss and accuracy during training of the
MLP.

#+name: code:mlp-metrics
#+begin_src jupyter-python :file img/mlp-loss.png :exports results
fig, (ax1,ax2) = plt.subplots(1,2, figsize=(8,3))
ax1.plot(history.history['loss'], label='training loss')
ax1.plot(history.history['val_loss'], label='validation loss')
ax1.set_xlabel('epoch')
ax1.set_ylabel('loss')
ax1.set_title('Model loss')
ax1.legend()
ax2.plot(history.history['acc'], label='training accuracy')
ax2.plot(history.history['val_acc'], label='validation accuracy')
ax2.set_xlabel('epoch')
ax2.set_ylabel('accuracy')
ax2.set_title('Model accuracy')
ax2.legend()
fig.tight_layout()
#+end_src

Finally, run the model on the test split

#+name: mlp-test
#+begin_src jupyter-python
model.evaluate(x[mask_te], y[mask_te], verbose=2)
#+end_src

#+RESULTS: mlp-test
: 32/32 - 0s - loss: 1.2662 - acc: 0.5920

Due to stochasticity, the accuracy is somewhere around 58-60%, which is not
amazing. Visualize the results using TSNE

#+name:mlp-trained-tsne
#+begin_src jupyter-python :file img/mlp-trained.png
out = model.call(x)
fig, ax = visualize(out, real_classes)
plt.show()
#+end_src

*** Semi-supervised learning using Graph convolutions
Idea is to use the information in the graph structure to aid classifying nodes.
If we assume nodes that are connected are related in such a way that they have a
higher probability of having the same class, then we can use a nodes neighbors
to help classify it. The mechanism for this is to use graph convolutions, which
by message-passing gathers information from neighbor features vectors reduces
that information to a single vector. This information is then hopefully a better
latent vector than just looking at the single node feature vector as was done
earlier.

First define some parameters
#+name: gcn-params
#+begin_src jupyter-python :results silent
hidden_layers = 32
patience = 10 # epochs with no improvement
lr = 1e-2
num_epochs = 200
loss_fn = CategoricalCrossentropy(reduction='sum')
optimizer = Adam(learning_rate=lr)
#+end_src

Next define the model using subclassing
#+name: gcn-model
#+caption: GCN model definition.
#+begin_src jupyter-python :results silent
class GCN(Model):
    def __init__(self, n_hidden, n_labels):
        super(GCN, self).__init__()
        self.dropout = Dropout(0.5)
        self.gcn0 = GCNConv(channels=n_hidden, activation='relu')
        self.classification = GCNConv(n_labels, activation='softmax')

    def call(self, inputs):
        x, a = inputs
        x = self.dropout(x)
        x = self.gcn0([x,a])
        return self.classification([x,a])

#+end_src

Load the data, =spektral.data.SingleLoader= loads all nodes from a dataset with a
single graph. Here it becomes slightly problematic since our dataset has one
graph. In order to properly use this, we need to use sampling weights such that
we only sample nodes (and subsequently edges) from the correct split. Hence, we
convert the binary masks to sampling weights that =Keras= can understand.

Reload the dataset and apply transform for =GCNConv=
#+begin_src jupyter-python :results silent
cora = spektral.datasets.citation.Citation(
    'cora',
    normalize_x=True,
    transforms=[
        LayerPreprocess(GCNConv),
        AdjToSpTensor()
    ])
#+end_src

#+name: gcn-load-data
#+begin_src jupyter-python :results none
# Equally weight samples in each split
def mask_to_weights(mask):
    return mask.astype(np.float32) / np.count_nonzero(mask)

weights_tr, weights_va, weights_te = [
    mask_to_weights(mask) for mask in [mask_tr, mask_va, mask_te]
]

loader_tr = SingleLoader(cora, sample_weights=weights_tr)
loader_va = SingleLoader(cora, sample_weights=weights_va)
loader_te = SingleLoader(cora, sample_weights=weights_te)
#+end_src

One interesting side effect of GCNs is that they work decently even without any training, due to them just using the graph structure. Try running the model without training and visualize the clusters by using

#+name: gcn-compile
#+begin_src jupyter-python :file img/gcn-untrained.png
model = GCN(hidden_layers, n_labels)
model.compile(optimizer, loss_fn, weighted_metrics=['acc'])
#+end_src

#+RESULTS: gcn-compile

Now train the network. Again, use early stopping to not overfit the model

#+name: gcn-train
#+begin_src jupyter-python :results output :exports code
history = model.fit(
    loader_tr.load(),
    steps_per_epoch=loader_tr.steps_per_epoch,
    epochs=num_epochs,
    validation_data=loader_va.load(),
    validation_steps=loader_va.steps_per_epoch,
    verbose=2,
    callbacks=[EarlyStopping(
        monitor='val_loss',
        mode='min',
        patience=patience,
        restore_best_weights=True
    )]
)

model.save(f'trained_models/gcn')
#+end_src

Figure ref:fig:gcn-metrics shows the loss and accuracy during training.

#+name: code:1gcn-metrics
#+begin_src jupyter-python :file img/gcn-loss.png :exports results
fig, (ax1,ax2) = plt.subplots(1,2, figsize=(8,3))
ax1.plot(history.history['loss'], label='training loss')
ax1.plot(history.history['val_loss'], label='validation loss')
ax1.set_xlabel('epoch')
ax1.set_ylabel('loss')
ax1.set_title('Model loss')
ax1.legend()
ax2.plot(history.history['acc'], label='training accuracy')
ax2.plot(history.history['val_acc'], label='validation accuracy')
ax2.set_xlabel('epoch')
ax2.set_ylabel('accuracy')
ax2.set_title('Model accuracy')
ax2.legend()
fig.tight_layout()
plt.show()
#+end_src

Test the model on the test split
#+begin_src jupyter-python
out = model.evaluate(loader_te.load(), steps=loader_te.steps_per_epoch)
out
#+end_src

#+RESULTS:
: 1/1 [==============================] - 0s 18ms/step - loss: 0.6633 - acc: 0.8060

Much better in comparison to the MLP model earlier. Next visualize it using TSNE

#+name:gcn-trained-tsne
#+begin_src jupyter-python :file img/gcn-trained.png
out = model.call([x, a])
fig, ax = visualize(out, real_classes)
plt.show()
#+end_src

*** Improved model using attention
We can use attention mechanisms in our convolution layers to further improve the prediction. Parameters for this model

Reload the dataset and apply transform for =GATConv=
#+begin_src jupyter-python :results silent
cora = spektral.datasets.citation.Citation(
    'cora',
    normalize_x=True,
    transforms=[
        LayerPreprocess(GATConv),
        AdjToSpTensor()
    ])

loader_tr = SingleLoader(cora, sample_weights=weights_tr)
loader_va = SingleLoader(cora, sample_weights=weights_va)
loader_te = SingleLoader(cora, sample_weights=weights_te)
#+end_src

Parameters used for this model. Add an =L2= regularizer to avoid overfitting
#+name: imp-params
#+begin_src jupyter-python :results silent
hidden_layers = 8
n_attn_heads = 8
patience = 100 # epochs with no improvement
lr = 5e-3
l2_reg = 2.5e-4
num_epochs = 1000
loss_fn = CategoricalCrossentropy(reduction='sum')
optimizer = Adam(learning_rate=lr)
#+end_src

Model definition
#+name: imp-model
#+caption: Attention model definition.
#+begin_src jupyter-python :results silent

class GCN_improved(Model):
    def __init__(self, n_hidden, n_labels):
        super(GCN_improved, self).__init__()
        self.do1 = Dropout(0.6)
        self.gat0 = GATConv(
            channels=n_hidden,
            attn_heads=n_attn_heads,
            concat_heads=True,
            dropout_rate=0.6,
            activation='elu',
            kernel_regularizer=l2(l2_reg),
            attn_kernel_regularizer=l2(l2_reg),
            bias_regularizer=l2(l2_reg),
        )
        self.do2 = Dropout(0.6)
        self.classification = GATConv(
            channels=n_labels,
            attn_heads=1,
            concat_heads=False,
            dropout_rate=0.6,
            activation='softmax',
            kernel_regularizer=l2(l2_reg),
            attn_kernel_regularizer=l2(l2_reg),
            bias_regularizer=l2(l2_reg),
        )

    def call(self, inputs):
        x, a = inputs
        x = self.do1(x)
        x = self.gat0([x,a])
        x = self.do2(x)
        return self.classification([x,a])

#+end_src

Compilation and training
#+name: imp-compile
#+begin_src jupyter-python
model = GCN_improved(hidden_layers, n_labels)
model.compile(optimizer, loss_fn, weighted_metrics=['acc'])

name = 'improved+reg'
log_dir = f'log/cora/{name}_{datetime.datetime.now().strftime("%Y%m%d-%H%M%S")}'
tensorboard_callback = tf.keras.callbacks.TensorBoard(log_dir=log_dir, histogram_freq=1, update_freq='batch')

history = model.fit(
    loader_tr.load(),
    steps_per_epoch=loader_tr.steps_per_epoch,
    epochs=num_epochs,
    validation_data=loader_va.load(),
    validation_steps=loader_va.steps_per_epoch,
    verbose=2,
    shuffle=False,
    callbacks=[
        tensorboard_callback,
        EarlyStopping(
            monitor='val_loss',
            mode='min',
            patience=patience,
            restore_best_weights=True
        )
    ]
)
model.save('trained_models/improved')
#+end_src

Figure ref:code:1gat-metrics shows the loss and accuracy during training of the
improved model using =GATConv= layers.

#+name: code:gat-metrics
#+begin_src jupyter-python :exports results :file img/gat-metrics.png
fig, (ax1,ax2) = plt.subplots(1,2, figsize=(8,3))
ax1.plot(history.history['loss'], label='training loss')
ax1.plot(history.history['val_loss'], label='validation loss')
ax1.set_xlabel('epoch')
ax1.set_ylabel('loss')
ax1.set_title('Model loss')
ax1.legend()
ax2.plot(history.history['acc'], label='training accuracy')
ax2.plot(history.history['val_acc'], label='validation accuracy')
ax2.set_xlabel('epoch')
ax2.set_ylabel('accuracy')
ax2.set_title('Model accuracy')
ax2.legend()
fig.tight_layout()
plt.show()
#+end_src

Test the model on the test split
#+begin_src jupyter-python
loader_te = SingleLoader(cora, sample_weights=weights_te) # Loads one graph
out = model.evaluate(loader_te.load(), steps=loader_te.steps_per_epoch)
out
#+end_src

#+RESULTS:
: 1/1 [==============================] - 0s 74ms/step - loss: 0.9821 - acc: 0.8440

Next visualize using TSNE

#+name: code:gat-trained-tsne
#+begin_src jupyter-python :file img/gat-trained.png
out = model.call([x,a])
fig, ax = visualize(out, real_classes)
plt.show()
#+end_src

*** Training
Use Kullback-Leibler divergence loss since the dataset comes with probability
distributions of the four classes. Testing and validation is still done on
discrete classes (argmax). I also use =Tensorboard= to log my results a bit more
efficiently. Finally, the early-stopping mechanism is implemented manually,
rather than through a callback.

#+begin_src jupyter-python :results silent
name = 'final64_lr-3'
optimizer = torch.optim.Adam(model.parameters(), lr=lr, weight_decay=l2_reg)
criterion = torch.nn.KLDivLoss(reduction='batchmean')
writer = SummaryWriter("./log/qbit/" + name + '_' + datetime.now().strftime("%Y%m%d-%H%M%S"))

def train(loader, writer):
    model.train()

    total_loss = 0
    for data in loader:  # Iterate in batches over the training dataset.
        out = model(data.x, data.edge_index, data.edge_attr, data.batch)  # Perform a single forward pass.
        target = data.y
        loss = criterion(out, target)  # Compute the loss.
        loss.backward()  # Derive gradients.
        optimizer.step()  # Update parameters based on gradients.
        total_loss += loss.item() * data.num_graphs
        optimizer.zero_grad()  # Clear gradients
    total_loss /= len(loader.dataset)
    return total_loss

@torch.no_grad()
def test(loader):
    correct = 0
    total_loss = 0
    for data in loader:  # Iterate in batches over the training/test dataset.
        out = model(data.x, data.edge_index, data.edge_attr, data.batch)
        pred = out.argmax(dim=1)  # Use the class with highest probability.
        target = data.y.argmax(dim=1)

        correct += int((pred == target).sum())

    return correct / len(loader.dataset)# Derive ratio of correct predictions
#+end_src

Torch doesn't seem to have a simple EarlyStopping mechanism, so I made one
myself. It supports minimum delta, checkpointing and min/max metrics.

#+begin_src jupyter-python
class EarlyStopping:
    def __init__(self, patience=10, delta=0, active=True,
                 save_checkpoint=False, path='ckpt.pt', mode='min',
                 verbose=False):
        self.patience = patience
        self.delta = delta
        self.counter = 0
        self.active = active
        self.best_val = None
        self.save_checkpoint = save_checkpoint
        self.verbose = verbose
        self.path=path
        self.early_stop = False

        if mode not in ['min', 'max']:
            print("EarlyCallback: Could not read mode, defaulting to min.")
            self.mode = 'min'
        if mode == 'min':
            self.mode_op = np.less
        elif mode == 'max':
            self.mode_op = np.greater
            self.delta *= -1

    def __call__(self, value, model):
        if self.active:
            if self.best_val is None:
                self.best_val = value
                self.save(value, model)
            elif self.mode_op(value + self.delta, self.best_val):
                self.best_val = value
                self.save(value, model)
                self.counter = 0
            else:
                self.counter += 1
                if self.counter > patience:
                    self.early_stop = True

    def save(self, value, model):
        if self.save_checkpoint:
            if self.verbose:
                print("Validation loss changed from {self.min_val} to {value}, saving model.")

            torch.save(model.state_dict(), self.path)


#+end_src

#+RESULTS:

Finally train and test the model.

#+begin_src jupyter-python
early_stop = EarlyStopping(patience, mode='max', path='ckpts/es_ckpt.pt', save_checkpoint=True)
epochs = []
tr_loss = []
va_acc = []
print("Begin training...")
for epoch in range(1, num_epochs + 1):
    # Train
    total_loss = train(train_loader, writer)

    # Early stopping
    curr_val_acc = test(val_loader)
    early_stop(curr_val_acc, model)
    if early_stop.early_stop:
        print("Patience exceeded.")
        break

    # Logging
    train_acc = test(train_loader)
    epochs.append(epoch)
    tr_loss.append(total_loss)
    va_acc.append(curr_val_acc)

    writer.add_scalar("train/loss", total_loss, epoch)
    writer.add_scalar("train/train accuracy", train_acc, epoch)
    writer.add_scalar("train/validation accuracy", curr_val_acc, epoch)

    if epoch % 5 == 0:
        print(f' Epoch: {epoch:03d}, Train Acc: {train_acc:.4f}, Val Acc: {curr_val_acc:.4f}')

print("End training.")
#+end_src

#+RESULTS:
: Begin training...
:  Epoch: 005, Train Acc: 0.7054, Val Acc: 0.6600
:  Epoch: 010, Train Acc: 0.7864, Val Acc: 0.7125
:  Epoch: 015, Train Acc: 0.8214, Val Acc: 0.7475
:  Epoch: 020, Train Acc: 0.8429, Val Acc: 0.7350
:  Epoch: 025, Train Acc: 0.8550, Val Acc: 0.7100
: Patience exceeded.
: End training.

#+begin_src jupyter-python
# model.load_state_dict(torch.load("es_ckpt.pt"))
torch.save(model.state_dict, 'trained_models/qbit.pt')
test_acc = test(test_loader)
print("Test_acc:", test_acc)
#+end_src

#+RESULTS:
: Test_acc: 0.80375

#+name: code:2metrics
#+begin_src jupyter-python :file img/2-loss.png
fig, (ax1,ax2) = plt.subplots(1,2, figsize=(8,3))
ax1.plot(epochs, tr_loss, label='training loss')
ax1.set_xlabel('epoch')
ax1.set_ylabel('loss')
ax1.set_title('Model loss')
ax1.legend()
ax2.plot(epochs, va_acc, label='validation accuracy')
ax2.set_xlabel('epoch')
ax2.set_ylabel('accuracy')
ax2.set_title('Model accuracy')
ax2.legend()
fig.tight_layout()
plt.show()
#+end_src

#+latex: \newpage
